; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_2 ?v1 - type_3 ?v2 - type_2)
 	      (pred_1 ?v6 - object ?v2 - type_2)
	      (pred_4 ?v1 - type_3 ?v7 - type_1)
	      (pred_3 ?v1 - type_3 ?v6 - object ?v7 - type_1))

   (:action op_1
       :parameters  (?v1 - type_3 ?v4 ?v3 - type_2)
       :precondition (and  (pred_2 ?v1 ?v4))
       :effect (and  (pred_2 ?v1 ?v3)
		     (not (pred_2 ?v1 ?v4))))

   (:action op_2
       :parameters (?v1 - type_3 ?v5 - object ?v8 - type_2 ?v7 - type_1)
       :precondition  (and  (pred_1 ?v5 ?v8) (pred_2 ?v1 ?v8) (pred_4 ?v1 ?v7))
       :effect (and (pred_3 ?v1 ?v5 ?v7)
		    (not (pred_1 ?v5 ?v8)) 
		    (not (pred_4 ?v1 ?v7))))

   (:action op_3
       :parameters (?v1 - type_3 ?v5 - object ?v8 - type_2 ?v7 - type_1)
       :precondition  (and  (pred_3 ?v1 ?v5 ?v7) (pred_2 ?v1 ?v8))
       :effect (and (pred_1 ?v5 ?v8)
		    (pred_4 ?v1 ?v7)
		    (not (pred_3 ?v1 ?v5 ?v7)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_04 - type_3
obj_07 obj_10 - type_1
obj_03 obj_05 obj_01 obj_02 - type_2
obj_09 obj_08 obj_06 - object)
(:init
(pred_2 obj_04 obj_03)
(pred_4 obj_04 obj_07)
(pred_4 obj_04 obj_10)
(pred_1 obj_09 obj_03)
(pred_1 obj_08 obj_05)
(pred_1 obj_06 obj_05)
)
(:goal
(and
(pred_1 obj_09 obj_02)
(pred_1 obj_08 obj_03)
(pred_1 obj_06 obj_03)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_04 ?b obj_10))))
)
)

; plan
1. (op_2 obj_04 obj_09 obj_03 obj_07)
   deleted: (pred_1 obj_09 obj_03) (pred_4 obj_04 obj_07)
   added: (pred_3 obj_04 obj_09 obj_07)
   goals met: 0 of 3
2. (op_1 obj_04 obj_03 obj_02)
   deleted: (pred_2 obj_04 obj_03)
   added: (pred_2 obj_04 obj_02)
   goals met: 0 of 3
3. (op_3 obj_04 obj_09 obj_02 obj_07)
   deleted: (pred_3 obj_04 obj_09 obj_07)
   added: (pred_1 obj_09 obj_02) (pred_4 obj_04 obj_07)
   goals met: 1 of 3
4. (op_1 obj_04 obj_02 obj_05)
   deleted: (pred_2 obj_04 obj_02)
   added: (pred_2 obj_04 obj_05)
   goals met: 1 of 3
5. (op_2 obj_04 obj_08 obj_05 obj_07)
   deleted: (pred_1 obj_08 obj_05) (pred_4 obj_04 obj_07)
   added: (pred_3 obj_04 obj_08 obj_07)
   goals met: 1 of 3
6. (op_1 obj_04 obj_05 obj_03)
   deleted: (pred_2 obj_04 obj_05)
   added: (pred_2 obj_04 obj_03)
   goals met: 1 of 3
7. (op_3 obj_04 obj_08 obj_03 obj_07)
   deleted: (pred_3 obj_04 obj_08 obj_07)
   added: (pred_1 obj_08 obj_03) (pred_4 obj_04 obj_07)
   goals met: 2 of 3
8. (op_1 obj_04 obj_03 obj_05)
   deleted: (pred_2 obj_04 obj_03)
   added: (pred_2 obj_04 obj_05)
   goals met: 2 of 3
9. (op_2 obj_04 obj_06 obj_05 obj_07)
   deleted: (pred_1 obj_06 obj_05) (pred_4 obj_04 obj_07)
   added: (pred_3 obj_04 obj_06 obj_07)
   goals met: 2 of 3
10. (op_1 obj_04 obj_05 obj_03)
   deleted: (pred_2 obj_04 obj_05)
   added: (pred_2 obj_04 obj_03)
   goals met: 2 of 3
11. (op_3 obj_04 obj_06 obj_03 obj_07)
   deleted: (pred_3 obj_04 obj_06 obj_07)
   added: (pred_1 obj_06 obj_03) (pred_4 obj_04 obj_07)
   goals met: 3 of 3
